app/controllers/posts_controller.rb

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "あああああ　編集"], ["updated_at", "2021-07-14 05:00:26.214767"], ["id", 27]]

  def create
    @post = Post.new(post_params)
    if params[:back]
      render :new
    elsif @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "とうこう"], ["created_at", "2021-07-14 04:38:47.766960"], ["updated_at", "2021-07-14 04:38:47.766960"]]